Repository: yoko-at-home/reactjs-docs-TM
Catalog: docs/hooks-reference_EN-US_ja.tmx
Source language: en_us
Languages: ja

source: > > We recommend using the [`exhaustive-deps`](https://github.com/facebook/react/issues/14920) rule as part of our [`eslint-plugin-react-hooks`](https://www.npmjs.com/package/eslint-plugin-react-hooks#installation) package.
ja: > > [`eslint-plugin-react-hooks`](https://www.npmjs.com/package/eslint-plugin-react-hooks#installation) パッケージの [`exhaustive-deps`](https://github.com/facebook/react/issues/14920) ルールを有効にすることをお勧めします。

source: Returns a [memoized](https://en.wikipedia.org/wiki/Memoization) value.
ja: [メモ化](https://en.wikipedia.org/wiki/Memoization)された値を返します。

source: Pass a "create" function and an array of dependencies.
ja: "作成用" 関数とそれが依存する値の配列を渡してください。

source: `useMemo` will only recompute the memoized value when one of the dependencies has changed.
ja: `useMemo` は依存配列の要素のいずれかが変化した場合にのみメモ化された値を再計算します。

source: This optimization helps to avoid expensive calculations on every render.
ja: この最適化によりレンダー毎に高価な計算が実行されるのを避けることができます。

source: Remember that the function passed to `useMemo` runs during rendering.
ja: `useMemo` に渡した関数はレンダー中に実行されるということを覚えておいてください。

source: Don't do anything there that you wouldn't normally do while rendering.
ja: レンダー中に通常やらないようなことをこの関数内でやらないようにしましょう。

source: For example, side effects belong in `useEffect`, not `useMemo`.
ja: 例えば副作用は `useMemo` ではなく `useEffect` の仕事です。

source: If no array is provided, a new value will be computed on every render.
ja: 配列が渡されなかった場合は、新しい値がレンダーごとに毎回計算されます。

source: **You may rely on `useMemo` as a performance optimization, not as a semantic guarantee.** In the future, React may choose to "forget" some previously memoized values and recalculate them on next render, e.g. to free memory for offscreen components.
ja: **`useMemo` はパフォーマンス最適化のために使うものであり、意味上の保証があるものだと考えないでください。**将来的に React は、例えば画面外のコンポーネント用のメモリを解放するため、などの理由で、メモ化された値を「忘れる」ようにする可能性があります。

source: Write your code so that it still works without `useMemo` — and then add it to optimize performance.
ja: `useMemo` なしでも動作するコードを書き、パフォーマンス最適化のために `useMemo` を加えるようにしましょう。

source: > Note > > The array of dependencies is not passed as arguments to the function.
ja: > 補足 > > 依存する値の配列は第 1 引数の関数に引数として渡されるわけではありません。

source: Conceptually, though, that's what they represent: every value referenced inside the function should also appear in the dependencies array.
ja: しかし概念としては、この記法は関数の引数が何なのかを表現しています。関数の内部で参照されているすべての値は依存の配列内にも現れるべきです。

source: `useRef` returns a mutable ref object whose `.current` property is initialized to the passed argument (`initialValue`).
ja: `useRef` は、`.current` プロパティが渡された引数 (`initialValue`) に初期化されているミュータブルな ref オブジェクトを返します。

source: The returned object will persist for the full lifetime of the component.
ja: 返されるオブジェクトはコンポーネントの存在期間全体にわたって存在し続けます。

source: A common use case is to access a child imperatively:
ja: よくあるユースケースは、子コンポーネントに命令型でアクセスするというものです：

source: Essentially, `useRef` is like a "box" that can hold a mutable value in its `.current` property.
ja: 本質的に `useRef` とは、書き換え可能な値を `.current` プロパティ内に保持することができる「箱」のようなものです。

source: You might be familiar with refs primarily as a way to [access the DOM](/docs/refs-and-the-dom.html).
ja: まずは ref のことを [DOM にアクセスする](/docs/refs-and-the-dom.html)手段として理解しているかもしれません。

source: If you pass a ref object to React with `<div ref={myRef} />`, React will set its `.current` property to the corresponding DOM node whenever that node changes.
ja: `<div ref={myRef} />` のようにして React に ref オブジェクトを渡した場合、React は DOM ノードに変更があるたびに `.current` プロパティをその DOM ノードに設定します。

source: However, `useRef()` is useful for more than the `ref` attribute.
ja: しかしながら `useRef()` は `ref` 属性で使うだけではなく、より便利に使えます。

source: It's [handy for keeping any mutable value around](/docs/hooks-faq.html#is-there-something-like-instance-variables) similar to how you'd use instance fields in classes.
ja: これはクラスでインスタンス変数を使うのと同様にして、[あらゆる書き換え可能な値を保持しておくのに便利](/docs/hooks-faq.html#is-there-something-like-instance-variables)です。

source: This works because `useRef()` creates a plain JavaScript object.
ja: これは `useRef()` がプレーンな JavaScript オブジェクトを作成するからです。

source: The only difference between `useRef()` and creating a `{current: ...}` object yourself is that `useRef` will give you the same ref object on every render.
ja: `useRef()` を使うことと自分で `{current: ...}` というオブジェクトを作成することとの唯一の違いとは、`useRef` は毎回のレンダーで同じ ref オブジェクトを返す、ということです。

source: Keep in mind that `useRef` *doesn't* notify you when its content changes.
ja: `useRef` は中身が変更になってもそのことを通知**しない**ということを覚えておいてください。

source: Mutating the `.current` property doesn't cause a re-render.
ja: `.current` プロパティを書き換えても再レンダーは発生しません。

source: If you want to run some code when React attaches or detaches a ref to a DOM node, you may want to use a [callback ref](/docs/hooks-faq.html#how-can-i-measure-a-dom-node) instead.
ja: DOM ノードを ref に割り当てたり割り当てを解除したりする際に何らかのコードを走らせたいという場合は、[コールバック ref](/docs/hooks-faq.html#how-can-i-measure-a-dom-node) を代わりに使用してください。

source: `useImperativeHandle` customizes the instance value that is exposed to parent components when using `ref`.
ja: `useImperativeHandle` は `ref` が使われた時に親コンポーネントに渡されるインスタンス値をカスタマイズするのに使います。

source: As always, imperative code using refs should be avoided in most cases.
ja: いつもの話ですが、ref を使った手続き的なコードはほとんどの場合に避けるべきです。

source: `useImperativeHandle` should be used with [`forwardRef`](/docs/react-api.html#reactforwardref):
ja: `useImperativeHandle` は [`forwardRef`](/docs/react-api.html#reactforwardref) と組み合わせて使います：

source: In this example, a parent component that renders `<FancyInput ref={inputRef} />` would be able to call `inputRef.current.focus()`.
ja: この例では、`<FancyInput ref={inputRef} />` をレンダーする親コンポーネントは `inputRef.current.focus()` を呼べるようになります。

source: The signature is identical to `useEffect`, but it fires synchronously after all DOM mutations.
ja: この関数のシグネチャは `useEffect` と同一ですが、DOM の変更があった後で同期的に副作用が呼び出されます。

source: Use this to read layout from the DOM and synchronously re-render.
ja: これは DOM からレイアウトを読み出して同期的に再描画を行う場合に使ってください。

source: Updates scheduled inside `useLayoutEffect` will be flushed synchronously, before the browser has a chance to paint.
ja: `useLayoutEffect` の内部でスケジュールされた更新はブラウザによって描画される前のタイミングで同期的に処理されます。

source: Prefer the standard `useEffect` when possible to avoid blocking visual updates.
ja: 可能な場合は画面の更新がブロックするのを避けるため、標準の `useEffect` を優先して使ってください。

source: > Tip > > If you're migrating code from a class component, note `useLayoutEffect` fires in the same phase as `componentDidMount` and `componentDidUpdate`.
ja: > ヒント > > クラスコンポーネントからコードを移行している場合、`useLayoutEffect` は `componentDidMount` や `componentDidUpdate` と同じフェーズで実行されるということに注意してください。

source: However, **we recommend starting with `useEffect` first** and only trying `useLayoutEffect` if that causes a problem.
ja: しかし**まず `useEffect` で始めてみて**、それで問題が発生する場合にのみ `useLayoutEffect` を試すことをお勧めします。

source: > >If you use server rendering, keep in mind that *neither* `useLayoutEffect` nor `useEffect` can run until the JavaScript is downloaded.
ja: > > サーバレンダリングを使用している場合は、`useLayoutEffect` と `useEffect` の**どちらも** JavaScript がダウンロードされるまでは実行できないということを覚えておいてください。

source: This is why React warns when a server-rendered component contains `useLayoutEffect`.
ja: サーバでレンダーされるコンポーネントに `useLayoutEffect` が含まれている場合に React が警告を発生するのは、これが理由です。

source: To fix this, either move that logic to `useEffect` (if it isn't necessary for the first render), or delay showing that component until after the client renders (if the HTML looks broken until `useLayoutEffect` runs).
ja: これを修正するには、そのロジックを `useEffect` に移動する（初回レンダーで必要がないロジックである場合）か、クライアントでレンダーされるまでコンポーネントの表示を遅らせる（`useLayoutEffect` が実行されるまで該当 HTML が正しく表示できない場合）ようにしてください。

source: > >To exclude a component that needs layout effects from the server-rendered HTML, render it conditionally with `showChild && <Child />` and defer showing it with `useEffect(() => { setShowChild(true); }, [])`.
ja: > > サーバでレンダーされる HTML からレイアウト副作用を必要とするコンポーネントを除外したい場合は、それを `showChild && <Child />` のようにして条件付きでレンダーするようにして、表示を `useEffect(() => { setShowChild(true); }, [])` のようにして遅延させてください。

source: This way, the UI doesn't appear broken before hydration.
ja: これにより、JavaScript コードが注入される前に壊れた見た目の UI が表示されないようになります。

source: `useDebugValue` can be used to display a label for custom hooks in React DevTools.
ja: `useDebugValue` を使って React DevTools でカスタムフックのラベルを表示することができます。

source: For example, consider the `useFriendStatus` custom Hook described in ["Building Your Own Hooks"](/docs/hooks-custom.html):
ja: 例えば ["独自フックの作成"](/docs/hooks-custom.html) で説明した `useFriendStatus` を例にします：

source: > Tip > > We don't recommend adding debug values to every custom Hook.
ja: > ヒント > > すべてのカスタムフックにデバッグ用の値を加えるのはお勧めしません。

source: It's most valuable for custom Hooks that are part of shared libraries.
ja: これが最も有用なのは共有ライブラリ内のカスタムフックです。

source: #### Defer formatting debug values {#defer-formatting-debug-values}
ja: #### デバッグ用の値のフォーマットを遅延させる {#defer-formatting-debug-values}

source: In some cases formatting a value for display might be an expensive operation.
ja: 値を表示用にフォーマットすることが高価な処理である場合があります。

source: It's also unnecessary unless a Hook is actually inspected.
ja: また、フックが実際に DevTools でインスペクトされない場合はフォーマット自体が不要な処理です。

source: For this reason `useDebugValue` accepts a formatting function as an optional second parameter.
ja: このため `useDebugValue` はオプションの第 2 引数としてフォーマット用関数を受け付けます。

source: This function is only called if the Hooks are inspected.
ja: この関数はフックがインスペクトされている場合にのみ呼び出されます。

source: It receives the debug value as a parameter and should return a formatted display value.
ja: この関数はデバッグ値を引数として受け取り、フォーマット済みの表示用の値を返します。

source: For example a custom Hook that returned a `Date` value could avoid calling the `toDateString` function unnecessarily by passing the following formatter:
ja: 例えば `Date` 型の値を返すカスタムフックでは、以下のようなフォーマッタ関数を渡すことで、不必要に `toDateString` を呼び出すのを避けることができます。
